package day14092022;
import java.util.Scanner;
/**
 Напишите программу, которая считывает пять слов из стандартного ввода и выводит каждое слово с новой строки. Слова должны быть в том же порядке.
 */
public class Application {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        String text1 = scanner.next();
        String text2 = scanner.next();
        String text3 = scanner.next();
        String text4 = scanner.next();
        String text5 = scanner.next();
        System.out.println();
        System.out.println(text1);
        System.out.println(text2);
        System.out.println(text3);
        System.out.println(text4);
        System.out.println(text5);




    }
}